Warning: missing "jr $ra" in last block (.initial).

Warning: missing "jr $ra" in last block (.L00409740).

struct _struct_B_1001A230_0x34 {
    /* 0x00 */ u32 unk0;                            /* inferred */
    /* 0x04 */ s32 unk4;                            /* inferred */
    /* 0x08 */ s32 unk8;                            /* inferred */
    /* 0x0C */ char padC[0x1C];                     /* maybe part of unk8[8]? */
    /* 0x28 */ s32 unk28;                           /* inferred */
    /* 0x2C */ s32 unk2C;                           /* inferred */
    /* 0x30 */ s32 unk30;                           /* inferred */
};                                                  /* size = 0x34 */

struct _struct_usersymbol_0xC {
    /* 0x0 */ s8 *unk0;                             /* inferred */
    /* 0x4 */ u32 unk4;                             /* inferred */
    /* 0x8 */ u32 unk8;                             /* inferred */
};                                                  /* size = 0xC */

struct _struct_yysvec_0xC {
    /* 0x0 */ u32 unk0;                             /* inferred */
    /* 0x4 */ s32 *unk4;                            /* inferred */
    /* 0x8 */ char pad8[4];
};                                                  /* size = 0xC */

s32 __assert(? *, ? *, ?);                          /* extern */
u64 __ll_mul(u64, u32, s32, u32);                   /* extern */
u64 __ull_div(s32, u32, ?, u32);                    /* extern */
u64 __ull_rem(u32, u32, ?, ?);                      /* extern */
s8 *atoi(s8 *);                                     /* extern */
u32 atol(? *, ?, u32, s8 *);                        /* extern */
? bzero(void *, ?, void *);                         /* extern */
s32 getopt(s32, s8 **, ? *);                        /* extern */
s32 memcmp(Elf *, ? *, ?, Elf *);                   /* extern */
s16 *memcpy(s16 *, s16 *, u32, u32);                /* extern */
? memset(u32 *, ?, u32, s8 *);                      /* extern */
? mktemp(u8 *);                                     /* extern */
void *mmap(?, s32, ?, ?, s32, s32);                 /* extern */
